Feature: Отримати дані від майстерні 
	As a Скульптор
	In order to отримати на профіль дані та доступ від майстерні
	I want to використовувати майстерню для створення скульптур.
  
Scenario 1: Скульптор склав договір на аренду та оплатив її
  Given Скульптор запросив дані та доступ від майстерні
    And договір на оренду підписаний
    And договір на оренду верифіковано
    And рахунок на оренду сплачено
   When Скульптор вибере майстерню
   Then надсилаємо на його профіль дані
    And надаємо профілю Скульптора відповідні права на всі системи
    And реєструємо поточний стан майстерні у системі
    
Scenario 2: Скульптор запросив доступ без договору та без оплати
  Given Скульптор запросив дані та доступ від майстерні
    And договору на оренду не підисано/неіснує
    And рахунок на оренду не сплачено
   When Скульптор намагається отримати доступ до майстерні 
   Then відмовляємо в доступі
    And пропонуємо підписати договір
    And пропонуємо сплатити оренду
