Feature: Авторизація на сервісі
	As a Скульптор
	In order to авторизуватись на сервісі
	I want to використовувати функціонал сервісу.
  
Scenario 1: Створення нового запису
  Given Скульптор створює новий запис
    And його дані є актуальними 
    And його дані укрінкалі
   When Скульптор вносить особистрі дані
   Then реєструємо Скульптора на сервісі
    And спостерігаємо профіль в системі
    
Scenario 2: Авторизація за існуючим аккаунтом
  Given Скульптор вже має власний профіль
    And профіль є у системі
   When Скульптор вносить дані для авторизації 
     And дані для авторизації Скульптора коректні
   Then надаємо доступ до сервісу
    And реєструємо інформацію про поточний сеанс
