Feature: Скласти графік 
	As a Менеджер
	In order to отримати список майстерень
	I want to складання графіку відвідування майстерень.
  
Scenario 1: Вибрані майстерні вільні
  Given Менеджер отримав список майстерень
    And майстерні з даного списку вільні
    And майстерень не більше 5-ти
    And профіль Скульптора верифікований
   When Менеджер формує остаточний графік
    And графік походжений з Скульптор
   Then надсилаємо остаточний графік на профіль Скульптора
    And організовуємо відвідування майстерень
    And вносимо дані про відвідуванняу в систему
   
Scenario 2: Деякі майстерні зайнятті 
  Given Менеджер отримав список майстерень
    And деякі майстерні зайнятті
    And майстерень не більше 5-ти
    And профіль Скульптора верифікований
   When Менеджер формує остаточний графік 
    And менеджер видаляє зайнятті майстерні
    And Скульптору запропоновано альтернативу
    And графік походжений з Скульптор
   Then надсилаємо остаточний графік на профіль Скульптора
    And організовуємо відвідування майстерень
    And вносимо дані про відвідуванняу в систему
